In [1]:
from datetime import datetime
import pandas_datareader.data as wb

stocklist = ['AAPL','GOOG','FB','AMZN','COP']

start = datetime(2016,6,8)
end = datetime(2016,6,10)

p = wb.DataReader(stocklist, 'google',start,end)

In [2]:
p.axes #show what you have captured

[Index(['Open', 'High', 'Low', 'Close', 'Volume'], dtype='object'),
 DatetimeIndex(['2016-06-08', '2016-06-09', '2016-06-10'], dtype='datetime64[ns]', name='Date', freq='D'),
 Index(['AAPL', 'AMZN', 'COP', 'FB', 'GOOG'], dtype='object')]

In [3]:
p.keys()

Index(['Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')

In [4]:
 p['Close']

             AAPL    AMZN    COP      FB    GOOG
Date
2016-06-08  98.94  726.64  47.49  118.39  728.28
2016-06-09  99.65  727.65  46.57  118.56  728.58
2016-06-10  98.83  717.91  44.51  116.62  719.41

In [5]:
p['Volume']

                  AAPL       AMZN        COP          FB       GOOG
Date
2016-06-08  20848131.0  2223366.0  9641001.0  14505596.0  1583701.0
2016-06-09  26601354.0  2170318.0  5425117.0  13859240.0   988914.0
2016-06-10  31712936.0  3425718.0  9008304.0  18510826.0  1216443.0

In [6]:
p[:,:,'AAPL']

             Open   High    Low  Close      Volume
Date
2016-06-08  99.02  99.56  98.68  98.94  20848131.0
2016-06-09  98.50  99.99  98.46  99.65  26601354.0
2016-06-10  98.53  99.35  98.48  98.83  31712936.0

In [7]:
p[:,'2016-06-10']

        Open    High     Low   Close      Volume
AAPL   98.53   99.35   98.48   98.83  31712936.0
AMZN  722.35  724.98  714.21  717.91   3425718.0
COP    45.90   46.12   44.26   44.51   9008304.0
FB    117.54  118.11  116.26  116.62  18510826.0
GOOG  719.47  725.89  716.43  719.41   1216443.0